'''
Файл для создания констант и некоторых значений, в других местах не пишем!!!
'''

#номер локации
location = 1

#очки
score = 0

#игровой цикл
running = True

# дефолтные значения для скорости влево, вправо, вверх
left_rapidity = -5
right_rapidity = 5
up_rapidity = -9

#дефолт значения для врагов
speed_enemy = 5

# кол-во кадров
FPS = 60

# константы-параметры окна
WIDTH = 1280
HEIGHT = 720

# константы-цвета
WHITE = (255, 255, 255)
BLUE = (0, 0, 255)
RED = (255, 0, 0)

GREEN = (0, 255, 0)
GOLD = (255, 215, 0)
BLACK = (0, 0, 0)    

#границы карты
map_width = 2000
map_height = 2000